[
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Weather Forecast Pro",
    "companyName": "SkyWatch Inc.",
    "id": 101,
    "description": "Accurate real-time weather updates with detailed 14-day forecasts, hyperlocal precipitation alerts, severe weather warnings, and interactive radar maps. Features include personalized weather notifications based on your location and activities, detailed humidity and wind speed analytics, sunrise/sunset times with golden hour notifications, and comprehensive historical weather data for trip planning. Receive real-time lightning strike detection, pollen and air quality indexes, and customizable widgets for your home screen.",
    "size": 45.2,
    "reviews": "12.4k",
    "ratingAvg": 4.5,
    "downloads": "1.5M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 750 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 4500 },
      { "name": "5 star", "count": 4700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "FitTracker",
    "companyName": "HealthTech Solutions",
    "id": 102,
    "description": "Track workouts, calories, and health metrics easily with advanced AI-powered fitness analysis and personalized training recommendations. Monitor heart rate zones, sleep patterns, hydration levels, and daily step counts with detailed weekly and monthly trend reports. Features include guided workout videos for all fitness levels, nutrition tracking with barcode scanner for food items, weight loss/gain progress tracking with body measurements, and social challenges with friends for motivation. Integration with popular fitness devices and smartwatches for comprehensive health monitoring.",
    "size": 82.7,
    "reviews": "8.9k",
    "ratingAvg": 4.3,
    "downloads": "1.2M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 3200 },
      { "name": "5 star", "count": 2730 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Budget Planner",
    "companyName": "FinanceMaster Ltd.",
    "id": 103,
    "description": "Manage your expenses and savings effectively with comprehensive financial planning tools that help you achieve your financial goals faster. Features include automatic expense categorization from bank transactions, customizable budget categories with spending limits, bill payment reminders and due date notifications, savings goal tracking with progress visualization, and investment portfolio monitoring. Generate detailed financial reports with charts and graphs, track net worth over time, and receive personalized money-saving tips based on your spending patterns. Bank-level security with encryption for all financial data.",
    "size": 32.1,
    "reviews": "6.7k",
    "ratingAvg": 4.6,
    "downloads": "0.9M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 2900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Photo Editor Plus",
    "companyName": "Creative Labs",
    "id": 104,
    "description": "Advanced editing tools for stunning photos with professional-grade features previously only available on desktop software. Includes AI-powered object removal and background replacement, hundreds of professional filters and LUTs, layer-based editing with blending modes, advanced color grading tools with curves and selective color adjustment, and RAW photo support for professional photographers. Features portrait enhancement tools with skin smoothing and eye brightening, batch editing for multiple photos, collage maker with hundreds of templates, and direct social media sharing with optimal sizing. Supports high-resolution export up to 4K with no quality loss.",
    "size": 105.5,
    "reviews": "21.5k",
    "ratingAvg": 4.8,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 13200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Language Tutor",
    "companyName": "EduGlobal",
    "id": 105,
    "description": "Learn new languages with interactive lessons featuring speech recognition technology for perfect pronunciation practice and real-time feedback. Comprehensive courses covering vocabulary, grammar, listening comprehension, and cultural insights across 40+ languages. Features include personalized learning paths based on your goals and schedule, conversation practice with native speaker audio, offline mode for learning without internet, and progress tracking with detailed statistics. Interactive games and challenges make learning fun, while spaced repetition algorithms ensure long-term retention. Business language courses and test preparation for official language certifications available.",
    "size": 78.3,
    "reviews": "9.5k",
    "ratingAvg": 4.4,
    "downloads": "1.8M",
    "ratings": [
      { "name": "1 star", "count": 450 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1700 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3150 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Meditation Guide",
    "companyName": "CalmSpace",
    "id": 106,
    "description": "Guided meditation sessions for mindfulness with hundreds of programs tailored to reduce stress, improve sleep, increase focus, and cultivate gratitude. Features include personalized meditation recommendations based on your mood and goals, sleep stories narrated by soothing voices to help you fall asleep faster, breathing exercises for anxiety relief, and daily mindfulness reminders. Track your meditation streak and progress with detailed statistics, join group meditation sessions live with instructors, and access specialized programs for specific needs like exam preparation, work stress, or relationship challenges. Background sounds and nature ambiance for creating your perfect meditation environment.",
    "size": 52.9,
    "reviews": "11.2k",
    "ratingAvg": 4.7,
    "downloads": "2.2M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 350 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 5600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Travel Assistant",
    "companyName": "GoExplore",
    "id": 107,
    "description": "Plan trips, book hotels, and discover places with comprehensive travel tools that simplify every aspect of your journey from inspiration to return. Features include AI-powered trip itinerary creation based on your preferences and budget, real-time flight tracking and price alerts, hotel comparisons with honest reviews and photos, and local experience bookings with verified providers. Access offline maps and navigation for foreign countries, currency conversion with no hidden fees, language phrasebooks for travelers, and emergency assistance services worldwide. Travel community where you can share experiences and get recommendations from fellow travelers.",
    "size": 67.4,
    "reviews": "7.6k",
    "ratingAvg": 4.2,
    "downloads": "1.1M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 1600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Recipe Book",
    "companyName": "Foodie Fun",
    "id": 108,
    "description": "Thousands of recipes with step-by-step instructions from world-class chefs and home cooks, featuring video tutorials and adjustable serving sizes. Advanced search filters for dietary restrictions including vegan, gluten-free, keto, paleo, and allergy-friendly options. Create weekly meal plans with automatic grocery list generation, scale recipes up or down with ingredient adjustments, and save your favorite recipes in personalized collections. Features include cooking timers for multiple dishes, nutritional information for every recipe, wine pairing suggestions, and the ability to submit your own recipes to the community. Seasonal collections and holiday specials regularly updated.",
    "size": 89.6,
    "reviews": "14.3k",
    "ratingAvg": 4.6,
    "downloads": "1.9M",
    "ratings": [
      { "name": "1 star", "count": 350 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6950 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Task Manager Pro",
    "companyName": "Productivity Tools Co.",
    "id": 109,
    "description": "Organize tasks, set reminders, and boost productivity with intelligent task management that adapts to your workflow and helps prioritize what matters most. Features include smart lists that automatically categorize tasks, recurring tasks with flexible scheduling, project templates for common workflows, and collaboration tools for team projects. Time tracking with productivity analytics shows where your time goes, while the focus mode minimizes distractions during work sessions. Integration with calendar apps, email clients, and cloud storage services. Advanced features include natural language input for quick task creation, location-based reminders, and progress tracking toward long-term goals.",
    "size": 41.8,
    "reviews": "8.3k",
    "ratingAvg": 4.5,
    "downloads": "1.3M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1300 },
      { "name": "4 star", "count": 3200 },
      { "name": "5 star", "count": 3000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Music Streamer",
    "companyName": "SoundWave",
    "id": 110,
    "description": "Stream millions of songs and create playlists with high-quality audio streaming, personalized recommendations, and social features for music discovery. Access to exclusive releases, live concert recordings, and artist interviews. Features include AI-generated playlists based on your mood and activities, offline listening with download capabilities, lyrics display synchronized with music playback, and crossfade between tracks for seamless listening. Radio stations curated by music experts, podcast integration within the same app, and family plans for multiple users. High-fidelity audio option for audiophiles and compatibility with various audio devices and smart speakers.",
    "size": 95.2,
    "reviews": "18.7k",
    "ratingAvg": 4.4,
    "downloads": "3.5M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 7700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "News Digest",
    "companyName": "InfoFlow",
    "id": 111,
    "description": "Personalized news feed from trusted sources with AI curation that learns your interests and presents balanced perspectives on current events. Features include topic-based customization allowing you to follow specific subjects, regions, or personalities, while avoiding news fatigue. Breaking news alerts with verified information before widespread reporting, deep-dive analysis pieces from expert journalists, and fact-checking services for questionable claims. Audio briefings for hands-free news consumption during commutes, offline reading mode for saved articles, and the ability to compare coverage of the same story across different publications for balanced understanding.",
    "size": 38.5,
    "reviews": "6.4k",
    "ratingAvg": 4.1,
    "downloads": "0.95M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 1700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Fitness Coach",
    "companyName": "ActiveLife",
    "id": 112,
    "description": "Personalized workout plans and video guides created by certified personal trainers with adaptations for home or gym environments and all fitness levels. Features include form correction using your phone's camera, workout scheduling that adapts to your progress, and exercise library with detailed instructions for proper technique. Nutrition guidance with meal planning based on your fitness goals, recovery tracking including recommended rest periods, and community challenges for motivation. Integration with heart rate monitors and fitness trackers for comprehensive data, virtual personal training sessions available, and specialized programs for specific goals like marathon training or body transformation.",
    "size": 120.3,
    "reviews": "15.6k",
    "ratingAvg": 4.7,
    "downloads": "2.4M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 7800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Sleep Tracker",
    "companyName": "RestWell",
    "id": 113,
    "description": "Monitor sleep patterns and improve sleep quality using advanced algorithms that analyze your sleep cycles without wearable devices. Features include smart alarm that wakes you during light sleep phases for more refreshed mornings, sleep environment analysis with suggestions for improvement, and detailed sleep stage reporting with trends over time. Integration with other health apps for comprehensive wellness picture, bedtime reminders based on your schedule, and wind-down routines to prepare for sleep. Sleep sounds and stories to help you fall asleep faster, snoring detection and recording for medical consultation, and personalized sleep tips based on your unique patterns and challenges.",
    "size": 55.7,
    "reviews": "7.2k",
    "ratingAvg": 4.3,
    "downloads": "1.05M",
    "ratings": [
      { "name": "1 star", "count": 350 },
      { "name": "2 star", "count": 550 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 2100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Shopping Deals",
    "companyName": "SavvyShop",
    "id": 114,
    "description": "Find the best discounts and deals online with price tracking across thousands of retailers and automatic notifications when prices drop on items you want. Features include browser extension that automatically applies coupon codes at checkout, price history charts showing how prices have changed over time, and deal alert customization for specific products or categories. Community voting on deal quality helps filter out misleading offers, while the saved searches feature notifies you when new deals match your criteria. Shopping list organization with price tracking, retailer ratings and reviews from real shoppers, and exclusive app-only deals not available elsewhere.",
    "size": 61.4,
    "reviews": "9.8k",
    "ratingAvg": 4.0,
    "downloads": "1.6M",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1100 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 3200 },
      { "name": "5 star", "count": 2300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Plant Identifier",
    "companyName": "GreenThumb",
    "id": 115,
    "description": "Identify plants and get care tips instantly using advanced image recognition that can identify over 50,000 plant species from photos of leaves, flowers, or bark. Features include detailed plant profiles with scientific and common names, comprehensive care guides tailored to your climate and growing conditions, and reminders for watering, fertilizing, and pruning. Disease diagnosis from photos of plant problems with treatment recommendations, plant journal to track growth and blooming cycles, and community forum for asking expert gardeners questions. Plant wishlist for future purchases, garden planning tools with companion planting suggestions, and seasonal gardening tasks specific to your region.",
    "size": 73.8,
    "reviews": "5.2k",
    "ratingAvg": 4.8,
    "downloads": "0.8M",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 3050 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Code Editor Pro",
    "companyName": "DevTools Inc.",
    "id": 116,
    "description": "Advanced code editing on the go with syntax highlighting for over 200 programming languages, intelligent code completion, and powerful debugging tools. Features include Git integration for version control directly from your mobile device, multiple cursor support for efficient editing, and code snippet library for frequently used patterns. Terminal access for command-line operations, file system browser for managing project files, and cloud synchronization of your coding environment across devices. Support for popular frameworks and libraries with autocomplete suggestions, code formatting with customizable style rules, and pair programming capabilities for collaborative coding sessions.",
    "size": 88.3,
    "reviews": "8.9k",
    "ratingAvg": 4.6,
    "downloads": "2.1M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Stock Tracker",
    "companyName": "FinancePro Ltd.",
    "id": 117,
    "description": "Real-time stock market tracking and analysis with advanced charting tools, customizable watchlists, and comprehensive financial data for informed investment decisions. Features include portfolio tracking with performance analytics, dividend tracking and projection tools, and earnings calendar with analyst expectations. Technical analysis indicators and drawing tools, news aggregation from financial publications with sentiment analysis, and options chain data for traders. Paper trading feature for risk-free practice, stock screener with hundreds of customizable filters, and educational resources for investors of all experience levels. Integration with brokerage accounts for automatic portfolio updates.",
    "size": 56.7,
    "reviews": "11.2k",
    "ratingAvg": 4.4,
    "downloads": "1.7M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 4200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Workout Planner",
    "companyName": "FitLife Solutions",
    "id": 118,
    "description": "Create and track personalized workout routines with exercise database featuring video demonstrations, proper form guidance, and muscle group targeting information. Features include workout calendar with drag-and-drop scheduling, progress tracking with photos and measurements, and automatic workout generation based on available equipment and time constraints. Rest timer with customizable intervals, superset and circuit creation tools, and integration with heart rate monitors for intensity tracking. Exercise library searchable by muscle group, equipment needed, or difficulty level, workout templates for common goals like strength building or fat loss, and social features for sharing workouts with friends.",
    "size": 72.5,
    "reviews": "15.6k",
    "ratingAvg": 4.7,
    "downloads": "2.8M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 7300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Video Editor Pro",
    "companyName": "Creative Studio",
    "id": 119,
    "description": "Professional video editing tools for mobile with timeline-based editing, multiple video and audio tracks, and support for 4K resolution export. Features include color grading tools with LUT support, speed control with smooth slow motion, and keyframe animation for advanced effects. Text overlays with custom fonts and animations, transition library with customizable parameters, and audio editing with noise reduction and voice enhancement. Green screen/chroma key functionality, picture-in-picture effects, and social media optimization with aspect ratio presets for different platforms. Direct sharing to video platforms, cloud project backup, and collaboration features for team projects.",
    "size": 132.8,
    "reviews": "23.4k",
    "ratingAvg": 4.8,
    "downloads": "4.2M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 12100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Mindfulness Coach",
    "companyName": "Peaceful Mind",
    "id": 120,
    "description": "Daily mindfulness exercises and meditation programs designed to reduce stress, improve focus, and cultivate emotional balance through scientifically-backed techniques. Features include personalized meditation paths based on your goals and experience level, mood tracking with correlation to practice frequency, and guided sessions ranging from 3-minute quick resets to 30-minute deep practices. Breathing exercises for immediate stress relief, body scan meditations for relaxation, and loving-kindness practices for improving relationships. Progress tracking with streaks and milestones, offline access to downloaded sessions, and integration with health apps for comprehensive wellness tracking. Corporate wellness programs available for teams.",
    "size": 48.6,
    "reviews": "9.8k",
    "ratingAvg": 4.5,
    "downloads": "1.9M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3800 },
      { "name": "5 star", "count": 4150 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Expense Tracker",
    "companyName": "MoneyManager Inc.",
    "id": 121,
    "description": "Track and categorize your daily expenses with automatic receipt scanning, bank synchronization, and intelligent spending pattern analysis to help you save more money. Features include customizable spending categories with budget limits, bill tracking with payment reminders, and financial goal setting with progress visualization. Multi-currency support for travelers, cash expense tracking, and investment account integration for net worth calculation. Generate detailed financial reports with export options, identify recurring subscriptions you may have forgotten, and receive personalized saving suggestions based on your spending habits. Family sharing for household budget management and year-end tax preparation summaries.",
    "size": 36.9,
    "reviews": "13.4k",
    "ratingAvg": 4.6,
    "downloads": "2.3M",
    "ratings": [
      { "name": "1 star", "count": 350 },
      { "name": "2 star", "count": 550 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 5900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Language Exchange",
    "companyName": "Global Connect",
    "id": 122,
    "description": "Practice languages with native speakers worldwide through text, voice, and video conversations with safety features and structured learning activities. Features include language partner matching based on shared interests and complementary language goals, correction tools for helping each other improve, and topic suggestions to keep conversations flowing. Structured practice sessions with specific grammar or vocabulary focuses, pronunciation feedback from native speakers, and cultural exchange discussions about traditions and daily life. Safety features including verified profiles, reporting systems, and moderation of conversations. Community events like language cafés and cultural exchange meetups, both virtual and in-person where available.",
    "size": 64.2,
    "reviews": "8.7k",
    "ratingAvg": 4.3,
    "downloads": "1.4M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 3200 },
      { "name": "5 star", "count": 2900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Calendar Pro",
    "companyName": "Schedule Master",
    "id": 123,
    "description": "Smart calendar with event scheduling and reminders that integrates with all your existing calendars and uses AI to help optimize your time management. Features include natural language event creation, smart suggestions for meeting times that work for all participants, and travel time calculation between appointments. Task integration that combines to-dos with your schedule, weather integration for outdoor events, and birthday/anniversary reminders with gift suggestions. Customizable views including day, week, month, and agenda, color coding for different life areas, and synchronization across all devices. Meeting preparation tools with agenda templates, follow-up task creation from meetings, and analytics on how you spend your time.",
    "size": 42.5,
    "reviews": "15.6k",
    "ratingAvg": 4.7,
    "downloads": "3.1M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Nutrition Guide",
    "companyName": "Healthy Eating",
    "id": 124,
    "description": "Track nutrition and get healthy meal plans with comprehensive food database, barcode scanning for packaged foods, and personalized recommendations based on your health goals. Features include macro and micronutrient tracking, meal planning with automatic grocery list generation, and restaurant nutrition information for eating out. Recipe analysis for homemade meals, water intake tracking with reminders, and supplement tracking with interaction warnings. Integration with fitness apps for complete health picture, progress photos and measurements, and community challenges for motivation. Specialized plans for various diets including vegetarian, vegan, keto, paleo, and medically-restricted diets with doctor consultation recommendations.",
    "size": 58.7,
    "reviews": "11.2k",
    "ratingAvg": 4.5,
    "downloads": "1.8M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 4800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Music Maker",
    "companyName": "Sound Studio",
    "id": 125,
    "description": "Create music with virtual instruments and loops featuring professional-grade synthesizers, drum machines, and recording capabilities previously only available in studio software. Features include multi-track recording with unlimited layers, MIDI controller support for external hardware, and audio effect processing with VST plugin compatibility. Sample library with thousands of royalty-free sounds, step sequencer for precise pattern creation, and automation recording for dynamic parameter changes. Music theory tools including scale highlighting and chord suggestions, collaboration features for remote music production, and direct publishing to streaming platforms. Educational tutorials for beginners and advanced producers alike.",
    "size": 156.3,
    "reviews": "18.7k",
    "ratingAvg": 4.6,
    "downloads": "2.9M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 6500 },
      { "name": "5 star", "count": 8200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Sleep Sounds",
    "companyName": "Relaxing Sounds",
    "id": 126,
    "description": "Soothing sounds for better sleep and relaxation with high-quality audio recordings of nature, ambient environments, and specially designed frequencies. Features include sound mixing allowing you to combine multiple sounds at adjustable volumes, sleep timer with gradual fade-out, and soundscapes for different purposes: concentration, relaxation, meditation, or sleep. Custom sound creation by recording your own environments, equalizer for fine-tuning sound frequencies, and smart alarm that wakes you gently with gradually increasing volume. Offline access to downloaded sounds, battery optimization for all-night use, and Bluetooth speaker compatibility. Sound recommendations based on time of day and your activity, and integration with health apps for sleep tracking correlation.",
    "size": 82.4,
    "reviews": "23.4k",
    "ratingAvg": 4.8,
    "downloads": "4.5M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 12600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Flashcards Pro",
    "companyName": "Study Smart",
    "id": 127,
    "description": "Create digital flashcards for effective learning using spaced repetition algorithms that optimize memory retention and adapt to your learning pace. Features include multimedia flashcards with images, audio, and mathematical equations, import/export for sharing decks with classmates, and progress tracking with detailed statistics on retention rates. Pre-made decks for standardized tests, professional certifications, and language learning, collaborative deck creation for study groups, and quiz modes for different types of recall testing. Offline study capability, synchronization across devices, and integration with academic calendars for exam preparation scheduling. Accessibility features including text-to-speech and dyslexia-friendly fonts.",
    "size": 34.8,
    "reviews": "8.9k",
    "ratingAvg": 4.4,
    "downloads": "1.6M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3550 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Voice Recorder",
    "companyName": "Audio Pro",
    "id": 128,
    "description": "High-quality voice recording and editing with professional features for journalists, students, musicians, and business professionals needing reliable audio capture. Features include lossless audio formats for archival quality, adjustable sample rates up to 96kHz, and real-time audio editing with cut, copy, paste, and trim functions. Noise reduction algorithms for cleaning up recordings, voice activation for hands-free recording, and transcription services with speaker identification. Cloud synchronization for backup and access across devices, organization with tags and folders, and sharing options with various compression levels. Interview mode with separate channels for multiple speakers, and integration with note-taking apps.",
    "size": 47.9,
    "reviews": "13.4k",
    "ratingAvg": 4.6,
    "downloads": "2.2M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Habit Tracker",
    "companyName": "Daily Routine",
    "id": 129,
    "description": "Build and track positive daily habits with motivational tools, streak tracking, and community support to help make lasting behavior changes. Features include habit scheduling with flexible recurrence patterns, progress visualization with charts and calendars, and reminder customization based on location, time, or other triggers. Habit stacking suggestions for combining new habits with existing routines, milestone celebrations for motivation, and journal integration for reflecting on habit progress. Templates for common habit goals like exercise, meditation, reading, or hydration, challenge creation to compete with friends, and data export for personal analysis. Integration with other health and productivity apps for comprehensive self-improvement tracking.",
    "size": 29.6,
    "reviews": "18.7k",
    "ratingAvg": 4.7,
    "downloads": "3.4M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 8200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "PDF Reader Pro",
    "companyName": "Document Tools",
    "id": 130,
    "description": "Advanced PDF reading and annotation tools with support for large documents, form filling, digital signatures, and secure document handling. Features include text highlighting and commenting, drawing tools with pressure sensitivity for tablets, and text recognition (OCR) for scanned documents. Form filling with automatic field detection, digital signature creation and application, and document merging/splitting/reordering. Password protection for sensitive documents, cloud storage integration for accessing files from anywhere, and collaboration features for team document review. Night mode for comfortable reading in low light, text-to-speech for listening to documents, and batch processing for multiple files.",
    "size": 68.3,
    "reviews": "15.6k",
    "ratingAvg": 4.5,
    "downloads": "2.7M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "VPN Secure",
    "companyName": "Privacy Shield",
    "id": 131,
    "description": "Secure VPN service for private browsing with military-grade encryption, no-log policy, and global server network for accessing content from anywhere. Features include automatic connection on untrusted Wi-Fi networks, kill switch that blocks internet if VPN disconnects unexpectedly, and split tunneling for choosing which apps use the VPN. Ad and malware blocking, dedicated IP options for business users, and protocol selection for optimal speed or security. Streaming-optimized servers for accessing geo-restricted content, family plans for protecting all household devices, and 24/7 customer support. Regular security audits and transparency reports to verify no-log policies.",
    "size": 52.7,
    "reviews": "23.4k",
    "ratingAvg": 4.3,
    "downloads": "4.8M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 9900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Yoga Instructor",
    "companyName": "Mind Body Studio",
    "id": 132,
    "description": "Guided yoga sessions for all skill levels with detailed pose instructions, modifications for different abilities, and programs for specific goals like flexibility, strength, or stress relief. Features include video classes with multiple camera angles, pose library with anatomical information, and personalized class recommendations based on your experience and goals. Class filtering by duration, intensity, focus area, or style (Hatha, Vinyasa, Yin, etc.), progress tracking for flexibility and strength improvements, and integration with health apps. Offline downloads for practicing anywhere, breath guidance synchronized with movement, and meditation sessions to complement physical practice. Special programs for specific needs like back pain relief, prenatal yoga, or office workers.",
    "size": 96.5,
    "reviews": "11.2k",
    "ratingAvg": 4.8,
    "downloads": "2.1M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 5700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Password Manager",
    "companyName": "Secure Vault",
    "id": 133,
    "description": "Store and manage passwords securely with automatic password generation, breach monitoring, and secure sharing features for families or teams. Features include autofill for apps and websites, password strength analysis with improvement suggestions, and secure notes for sensitive information beyond passwords. Digital wallet for payment cards and identification documents, two-factor authentication code generation, and emergency access for trusted contacts. Cross-platform synchronization with end-to-end encryption, password import from browsers and other managers, and dark web monitoring for compromised credentials. Business plans with administrative controls and activity reporting, and family sharing with parental controls.",
    "size": 38.2,
    "reviews": "18.7k",
    "ratingAvg": 4.6,
    "downloads": "3.2M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 6500 },
      { "name": "5 star", "count": 9400 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Drawing Pad",
    "companyName": "Art Studio",
    "id": 134,
    "description": "Digital drawing and painting application with professional tools for artists, designers, and hobbyists featuring realistic brushes, layers, and advanced editing capabilities. Features include pressure-sensitive brush support for compatible styluses, unlimited layers with blending modes, and customizable brush engine for creating unique tools. Color mixing palette with traditional media simulation, symmetry tools for mandalas and patterns, and perspective guides for architectural drawing. Import/export in various formats including PSD with layer support, time-lapse recording of your drawing process, and community gallery for sharing artwork. Tutorials for different skill levels, reference image import for tracing or study, and print preparation tools.",
    "size": 124.8,
    "reviews": "8.9k",
    "ratingAvg": 4.5,
    "downloads": "1.5M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3400 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Speed Test Pro",
    "companyName": "Network Tools",
    "id": 135,
    "description": "Test your internet connection speed with accurate measurements of download, upload, and ping times, plus additional diagnostics for network troubleshooting. Features include historical speed test results with graphs showing performance over time, server selection for testing against different locations, and network information display including IP address and connection type. Ping and jitter measurement for gaming and VoIP quality assessment, video streaming quality test, and Wi-Fi analyzer for finding optimal channels. Data usage tracking with alerts for approaching limits, speed test scheduling for automatic monitoring, and comparison with regional averages. Business features for IT professionals including multiple location testing and detailed reporting.",
    "size": 27.9,
    "reviews": "23.4k",
    "ratingAvg": 4.4,
    "downloads": "5.2M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2800 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 11100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Recipe Finder",
    "companyName": "Cook Smart",
    "id": 136,
    "description": "Find recipes based on ingredients you have with smart search that suggests dishes you can make without additional grocery shopping, reducing food waste. Features include pantry inventory tracking with expiration date reminders, recipe scaling for different serving sizes, and meal planning with nutritional analysis. Shopping list generation from selected recipes with organization by grocery store aisle, substitution suggestions for missing ingredients, and dietary restriction filtering. Seasonal recipe collections, cooking timer with multiple dishes supported, and family meal planning for different preferences within households. Integration with grocery delivery services for one-click ordering of missing ingredients, and community recipe sharing with rating system.",
    "size": 63.4,
    "reviews": "11.2k",
    "ratingAvg": 4.7,
    "downloads": "1.9M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 5150 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Screen Recorder",
    "companyName": "Capture Pro",
    "id": 137,
    "description": "Record your screen with audio commentary for creating tutorials, gameplay videos, bug reports, or presentation recordings with professional editing tools built-in. Features include adjustable recording area (full screen, window, or custom region), system audio and microphone recording separately or together, and camera overlay for picture-in-picture videos. Annotation tools for highlighting during recording, video trimming and editing after capture, and export in various formats and resolutions. Scheduled recording for capturing live streams or broadcasts, GIF creation from screen recordings, and cloud storage integration for easy sharing. Business features for customer support and training teams including annotation presets and team libraries.",
    "size": 58.6,
    "reviews": "15.6k",
    "ratingAvg": 4.5,
    "downloads": "2.6M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Brain Games",
    "companyName": "Mind Exercise",
    "id": 138,
    "description": "Games to improve memory and cognitive skills with scientifically-designed exercises that adapt to your performance to provide optimal brain training. Features include personalized training program based on initial assessment, progress tracking with detailed cognitive profile, and daily workouts targeting different brain functions. Games focusing on memory, attention, problem-solving, flexibility, and speed, with difficulty adjustment based on performance. Brain health tips and articles based on latest neuroscience research, social features for competing with friends, and offline play capability. Meditation exercises for stress reduction which impacts cognitive performance, and integration with health apps for holistic wellness tracking.",
    "size": 87.3,
    "reviews": "8.9k",
    "ratingAvg": 4.6,
    "downloads": "1.7M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Currency Converter",
    "companyName": "Finance Tools",
    "id": 139,
    "description": "Real-time currency exchange rates with historical charts, offline mode for recent rates, and tools for calculating transfer fees and total conversion costs. Features include multi-currency conversion for travel budgeting, rate alerts for target exchange rates, and historical comparison to see how rates have changed over time. Calculator for including transfer fees and commissions in conversions, tipping calculator for different countries, and salary comparison across countries with cost of living adjustment. Currency news and analysis for understanding market movements, watchlist for frequently used currencies, and bill splitting with currency conversion for international groups. Business features for invoicing in multiple currencies and expense tracking for international travel.",
    "size": 31.5,
    "reviews": "13.4k",
    "ratingAvg": 4.7,
    "downloads": "2.4M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Voice Translator",
    "companyName": "Global Translator",
    "id": 140,
    "description": "Real-time voice translation in multiple languages with conversation mode for natural dialogues, offline translation packs for travel without internet, and camera translation for signs and menus. Features include speech-to-text translation with playback in translated language, phrasebook for common travel situations, and pronunciation guide with native speaker audio. Text translation with formatting preservation, language detection for unknown text, and translation history for frequently used phrases. Cultural tips for avoiding misunderstandings, business terminology packs for professional use, and integration with messaging apps for translated conversations. Accessibility features including translation for hearing impaired with text display and vibration patterns.",
    "size": 142.7,
    "reviews": "18.7k",
    "ratingAvg": 4.4,
    "downloads": "3.3M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 6500 },
      { "name": "5 star", "count": 8200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Document Scanner",
    "companyName": "Scan Pro",
    "id": 141,
    "description": "Scan documents and convert to PDF with automatic edge detection, perspective correction, and image enhancement for professional-quality digital documents. Features include multi-page document scanning with automatic page detection, OCR (optical character recognition) for making scanned text searchable and editable, and cloud storage integration for organized document management. Batch scanning for processing multiple documents at once, various export formats including PDF, JPEG, and Word, and annotation tools for marking up scanned documents. Business card scanning with contact information extraction, receipt scanning with expense tracking integration, and secure sharing with password protection. Organization with tags, folders, and search functionality, plus integration with document management systems.",
    "size": 73.8,
    "reviews": "15.6k",
    "ratingAvg": 4.8,
    "downloads": "2.9M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 7300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Workout Timer",
    "companyName": "Fit Timer",
    "id": 142,
    "description": "Customizable timer for workout intervals with pre-set configurations for common training methods and ability to create custom interval sequences. Features include tabata timer with work/rest intervals, EMOM (every minute on the minute) timer, and AMRAP (as many rounds as possible) tracking. Circuit timer with multiple exercises and rest periods, countdown and count-up modes, and voice announcements for interval changes. Vibration alerts for silent workouts, lap tracking for recording multiple rounds, and history of previous workouts. Share timer configurations with training partners, large display mode for visibility during workouts, and integration with music apps for workout playlists. Pre-made timers for popular workout programs and ability to save custom routines.",
    "size": 29.4,
    "reviews": "8.9k",
    "ratingAvg": 4.5,
    "downloads": "1.4M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Photo Collage",
    "companyName": "Picture Studio",
    "id": 143,
    "description": "Create beautiful photo collages and layouts with hundreds of templates, customizable grids, and advanced editing tools for perfect social media posts. Features include drag-and-drop interface for arranging photos, adjustable border sizes and colors, and background patterns or images. Text overlay with various fonts and effects, sticker library for decoration, and filter application to entire collage or individual photos. Aspect ratio presets for different social media platforms, high-resolution export for printing, and quick share to social networks. Template marketplace with designs for special occasions, batch creation for multiple collages, and integration with cloud photo libraries. Advanced features like perspective correction and automatic color matching between photos.",
    "size": 68.9,
    "reviews": "11.2k",
    "ratingAvg": 4.6,
    "downloads": "2.1M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 4800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Journal Pro",
    "companyName": "Daily Journal",
    "id": 144,
    "description": "Digital journal with encryption and cloud sync for private reflection, habit tracking, and memory keeping with multimedia support and organizational tools. Features include rich text formatting, photo and video attachments, and location tagging for entries. Mood tracking with correlation to activities and people, gratitude journaling prompts, and daily reflection questions. Search functionality across all entries, tagging system for categorization, and calendar view to see entries over time. Export options for backup or printing, password protection with biometric authentication, and template creation for recurring journal types. Integration with health apps for comprehensive life tracking, and writing prompts for overcoming writer's block.",
    "size": 45.6,
    "reviews": "13.4k",
    "ratingAvg": 4.7,
    "downloads": "2.3M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6550 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "QR Code Scanner",
    "companyName": "Scan Tools",
    "id": 145,
    "description": "Fast and reliable QR code scanner with additional features for creating your own QR codes, scanning barcodes, and managing scan history for easy reaccess. Features include instant scanning without needing to take a photo, batch scanning for multiple codes at once, and history of previously scanned codes with organization options. QR code creation with customization of colors, logos, and frame styles, and support for various data types including URLs, contact information, Wi-Fi credentials, and event details. Barcode scanning for product information and price comparison, flashlight integration for scanning in dark environments, and vibration or sound confirmation of successful scan. Business features including QR code analytics for tracking scans of your created codes.",
    "size": 26.7,
    "reviews": "23.4k",
    "ratingAvg": 4.8,
    "downloads": "4.7M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 12600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Math Solver",
    "companyName": "Study Helper",
    "id": 146,
    "description": "Solve math problems with step-by-step solutions using camera input, handwriting recognition, or manual entry, covering topics from basic arithmetic to advanced calculus. Features include equation solving with detailed steps, graphing calculator with multiple functions, and geometry problem solving with shape recognition. Word problem analysis breaking down real-world scenarios into mathematical equations, unit conversion for scientific calculations, and statistical analysis tools. Practice problems with varying difficulty levels, test preparation for standardized exams, and bookmarking for difficult problems to review later. Integration with note-taking apps, sharing solutions with study groups, and adaptive learning that identifies areas needing improvement.",
    "size": 58.3,
    "reviews": "15.6k",
    "ratingAvg": 4.6,
    "downloads": "2.8M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Alarm Clock Pro",
    "companyName": "Wake Up Easy",
    "id": 147,
    "description": "Smart alarm clock with sleep tracking that analyzes your sleep patterns to wake you during light sleep phases for more refreshed mornings. Features include gradual volume increase for gentle waking, nature sounds or music as alarm tones, and snooze customization with limits to prevent oversleeping. Sleep statistics showing time spent in different sleep stages, bedtime reminders based on your schedule, and smart skip for weekends or holidays. Sunrise simulation alarm that gradually increases light before sound alarm, nap timer with optimal duration suggestions, and integration with smart home devices. Multiple alarm profiles for different days or situations, challenge mode requiring puzzles to turn off alarm, and sleep environment suggestions for better rest.",
    "size": 39.2,
    "reviews": "18.7k",
    "ratingAvg": 4.5,
    "downloads": "3.6M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 8200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Plant Care Guide",
    "companyName": "Green Garden",
    "id": 148,
    "description": "Care tips and reminders for your plants with identification features, problem diagnosis, and personalized care schedules based on plant type and environment. Features include watering reminders adjusted for season and weather, fertilizing schedule based on plant growth phase, and repotting alerts when plants outgrow containers. Pest and disease identification from photos with treatment recommendations, plant library with detailed care requirements for thousands of species, and growth tracking with photo journal. Light meter using phone camera to assess if plants receive adequate light, community forum for asking expert gardeners questions, and wishlist for plants you want to acquire. Integration with weather apps for adjusting care during heatwaves or cold snaps.",
    "size": 52.8,
    "reviews": "8.9k",
    "ratingAvg": 4.7,
    "downloads": "1.6M",
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 4200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "White Noise",
    "companyName": "Sound Therapy",
    "id": 149,
    "description": "Various white noise sounds for focus and sleep with mixing capabilities, timer functions, and sound profiles scientifically designed for different cognitive states. Features include sound mixing allowing combination of multiple sounds at adjustable volumes, sleep timer with gradual fade-out, and soundscapes for different purposes: concentration, relaxation, meditation, or sleep. Custom sound creation by recording your own environments, equalizer for fine-tuning sound frequencies, and smart alarm that wakes you gently with gradually increasing volume. Offline access to downloaded sounds, battery optimization for all-night use, and Bluetooth speaker compatibility. Sound recommendations based on time of day and your activity, and integration with health apps for sleep tracking correlation.",
    "size": 84.6,
    "reviews": "11.2k",
    "ratingAvg": 4.8,
    "downloads": "2.2M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 5700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Pomodoro Timer",
    "companyName": "Focus Timer",
    "id": 150,
    "description": "Pomodoro technique timer for productivity with customizable work/break intervals, task tracking, and statistics to analyze your focus patterns over time. Features include standard 25/5 Pomodoro intervals or fully customizable timing, task list integration to track what you work on during each session, and statistics showing your most productive times of day. Break suggestions including stretching exercises or eye relaxation techniques, focus sounds or white noise during work sessions, and goal setting for daily Pomodoro targets. Minimalist interface to reduce distractions, notifications to start breaks on time, and synchronization across devices. Team Pomodoro for coordinated focus sessions in remote teams, and integration with calendar apps for scheduling focused work blocks.",
    "size": 32.7,
    "reviews": "13.4k",
    "ratingAvg": 4.6,
    "downloads": "2.5M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Cloud Storage",
    "companyName": "Cloud Secure",
    "id": 151,
    "description": "Secure cloud storage for your files with end-to-end encryption, automatic photo backup, and file synchronization across all your devices for seamless access anywhere. Features include automatic camera roll backup with organization by date and location, file versioning to recover previous versions of documents, and selective sync to choose which folders sync to which devices. Sharing with password protection and expiration dates, collaboration on documents with real-time editing, and offline access to important files. Integration with productivity apps for direct saving to cloud, large file support for videos and design files, and family plans with separate accounts and shared storage. Business features including administrative controls and activity auditing.",
    "size": 47.5,
    "reviews": "23.4k",
    "ratingAvg": 4.4,
    "downloads": "5.1M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 9900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Speed Reading",
    "companyName": "Read Fast",
    "id": 152,
    "description": "Improve reading speed and comprehension with scientifically-designed exercises, progress tracking, and techniques used by competitive speed readers. Features include reading tests to establish baseline speed and comprehension, guided exercises using RSVP (Rapid Serial Visual Presentation) technique, and comprehension tests after each reading session. Tracking of progress over time with detailed statistics, personalized training plans based on your goals, and techniques for reducing subvocalization and increasing eye span. Integration with eBook readers to practice on your own material, article import from web browsers for practice on interesting content, and games that make training enjoyable. Techniques for different types of reading material: technical documents, fiction, news articles, and academic texts.",
    "size": 56.9,
    "reviews": "8.9k",
    "ratingAvg": 4.5,
    "downloads": "1.7M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3550 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Barcode Scanner",
    "companyName": "Scan Shop",
    "id": 153,
    "description": "Scan barcodes to compare prices and info across retailers, track price history, and manage product inventory for home or business use. Features include price comparison across online and local stores, product reviews and ratings aggregation, and nutritional information display for food items. Price history charts showing how prices have changed over time, deal alerts when items drop below target price, and shopping list creation from scanned items. Inventory management for tracking products you own with expiration date alerts, product recall notifications, and allergen information for food items. Business features for inventory management and point-of-sale systems, and integration with grocery delivery services.",
    "size": 43.8,
    "reviews": "15.6k",
    "ratingAvg": 4.7,
    "downloads": "2.9M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Drink Water Reminder",
    "companyName": "Health Reminder",
    "id": 154,
    "description": "Reminders to stay hydrated throughout the day with personalized water intake goals based on your body metrics, activity level, and climate. Features include customizable reminder intervals and messages, tracking of different beverage types with their hydration values, and integration with fitness apps to adjust goals based on exercise. Progress visualization with daily and weekly statistics, achievement badges for consistency milestones, and challenges with friends for motivation. Water intake calculator considering weight, height, age, and activity level, weather-based adjustment for hot days, and medication reminder integration for those needing water with pills. Sync across devices, Apple Watch and Wear OS compatibility, and integration with smart water bottles for automatic tracking.",
    "size": 28.3,
    "reviews": "11.2k",
    "ratingAvg": 4.6,
    "downloads": "2.0M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 4800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Color Picker",
    "companyName": "Design Tools",
    "id": 155,
    "description": "Pick colors from images and create palettes with professional color tools including harmony generation, accessibility checking, and format conversion for designers and developers. Features include eyedropper tool for selecting colors from any image on screen, palette creation with complementary, analogous, or triadic color schemes, and color blindness simulation to check accessibility. Conversion between color formats (HEX, RGB, CMYK, HSL, etc.), color history for recently used colors, and organization of palettes into projects. Integration with design apps for quick color application, gradient generator with multiple stops, and material design or iOS system color libraries. Community palette sharing and trending color scheme discovery for inspiration.",
    "size": 36.7,
    "reviews": "8.9k",
    "ratingAvg": 4.5,
    "downloads": "1.5M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Crypto Tracker",
    "companyName": "Crypto Watch",
    "id": 156,
    "description": "Track cryptocurrency prices and portfolio with real-time alerts, news aggregation, and advanced charting tools for informed trading decisions. Features include portfolio tracking with profit/loss calculation, price alerts for significant movements, and detailed charts with technical indicators. News aggregation from crypto publications with sentiment analysis, calendar of upcoming events affecting cryptocurrency markets, and wallet integration for automatic portfolio updates. Multiple exchange support for price comparison, tax calculation tools for reporting, and educational resources for beginners. Security features including no exchange linking required for basic tracking, and privacy-focused design that doesn't require personal information.",
    "size": 62.4,
    "reviews": "18.7k",
    "ratingAvg": 4.4,
    "downloads": "3.4M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 6500 },
      { "name": "5 star", "count": 8200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Stopwatch Pro",
    "companyName": "Precision Timer",
    "id": 157,
    "description": "Advanced stopwatch with lap times, split tracking, and statistical analysis for athletic training, scientific experiments, or any activity requiring precise timing. Features include lap memory with detailed statistics (fastest, slowest, average), countdown timer with multiple intervals, and vibration alerts for interval training. Export of timing data for analysis in spreadsheets, large display mode for visibility at distance, and background operation allowing use of other apps while timing. Multiple timers running simultaneously for different activities, preset configurations for common timing needs, and share functionality for sending results to coaches or colleagues. Integration with fitness apps for workout tracking, and voice control for hands-free operation during activities.",
    "size": 24.9,
    "reviews": "13.4k",
    "ratingAvg": 4.8,
    "downloads": "2.3M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Vocabulary Builder",
    "companyName": "Word Master",
    "id": 158,
    "description": "Learn new words with flashcards and quizzes using spaced repetition algorithms, contextual examples, and pronunciation practice with speech recognition. Features include personalized word lists based on your reading level and goals, example sentences from literature and news to show word usage, and pronunciation practice with feedback. Word origins and etymology for better understanding and retention, synonym and antonym exploration, and word families showing related terms. Progress tracking with statistics on words mastered, integration with eBook readers to automatically add unfamiliar words, and game modes for fun review. Specialized lists for test preparation (SAT, GRE, etc.), professional terminology, and foreign language learning.",
    "size": 48.6,
    "reviews": "8.9k",
    "ratingAvg": 4.6,
    "downloads": "1.8M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Flight Tracker",
    "companyName": "Travel Tools",
    "id": 159,
    "description": "Real-time flight status and tracking with airport information, delay predictions, and travel planning tools for stress-free air travel. Features include live flight tracking on map view with aircraft type and altitude, airport information with terminal maps and amenities, and delay predictions using historical data and weather. Flight status notifications for gate changes, delays, or cancellations, baggage claim information upon arrival, and weather at departure and arrival airports. Trip organization with multiple flights in itinerary, integration with calendar apps for automatic scheduling, and sharing flight details with people meeting you. Alternative flight suggestions during disruptions, and airport navigation with estimated walking times between gates.",
    "size": 67.3,
    "reviews": "11.2k",
    "ratingAvg": 4.7,
    "downloads": "2.1M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 4800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "BMI Calculator",
    "companyName": "Health Metrics",
    "id": 160,
    "description": "Calculate BMI and track health metrics with additional tools for body fat estimation, ideal weight range calculation, and progress tracking toward health goals. Features include BMI calculation with interpretation based on age and gender, body fat percentage estimation using multiple methods, and ideal weight range based on body frame size. Progress tracking with graphs showing changes over time, goal setting with milestone celebrations, and integration with fitness apps for comprehensive health picture. Health risk assessment based on BMI and other factors, recommendations for healthy weight management, and educational content about body composition. Privacy-focused design with optional cloud backup, and family tracking for monitoring children's growth patterns.",
    "size": 31.8,
    "reviews": "15.6k",
    "ratingAvg": 4.5,
    "downloads": "2.7M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Audio Book Player",
    "companyName": "Listen Pro",
    "id": 161,
    "description": "Audiobook player with sleep timer, playback speed adjustment, and bookmarking features for enjoying audiobooks from various sources with optimal listening experience. Features include variable playback speed from 0.5x to 3x, sleep timer with gradual volume decrease, and chapter navigation for easy browsing. Bookmarking with notes for important sections, equalizer for sound optimization, and automatic bookmark syncing across devices. Support for various audio formats including MP3, M4B, and streaming services integration, background playback allowing use of other apps while listening, and car mode for safe driving interface. Library organization with tags and collections, listening statistics tracking, and recommendations based on your listening history.",
    "size": 58.4,
    "reviews": "8.9k",
    "ratingAvg": 4.6,
    "downloads": "1.6M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Period Tracker",
    "companyName": "Women's Health",
    "id": 162,
    "description": "Track menstrual cycle and symptoms with predictions, health insights, and personalized recommendations for understanding and optimizing reproductive health. Features include cycle prediction with fertile window identification, symptom tracking with correlation analysis, and medication reminder for birth control or supplements. Health insights identifying patterns in symptoms, mood, or energy levels, and integration with other health apps for comprehensive wellness picture. Pregnancy mode with week-by-week information and checklists, community forum for asking questions and sharing experiences, and privacy protection with optional password lock. Educational content about reproductive health, doctor visit preparation with symptom history export, and partner sharing for involving significant others in health journey.",
    "size": 42.7,
    "reviews": "18.7k",
    "ratingAvg": 4.7,
    "downloads": "3.5M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 8200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Unit Converter",
    "companyName": "Convert Pro",
    "id": 163,
    "description": "Convert between various units of measurement with comprehensive category coverage, historical units, and specialized conversions for engineering and scientific applications. Features include conversion for length, weight, temperature, volume, area, speed, time, pressure, power, energy, and many more specialized categories. Currency conversion with real-time exchange rates, cooking measurements with ingredient-specific conversions, and historical units no longer in common use. Favorites for frequently used conversions, calculation history for reference, and reverse conversion with single tap. Custom unit creation for specialized needs, sharing of conversion results, and integration with other apps through sharing extension. Educational mode explaining conversion formulas and relationships between units.",
    "size": 34.5,
    "reviews": "13.4k",
    "ratingAvg": 4.8,
    "downloads": "2.4M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Social Media Manager",
    "companyName": "Social Pro",
    "id": 164,
    "description": "Schedule and manage social media posts across multiple platforms with analytics, content calendar, and collaboration tools for individuals and teams. Features include post scheduling with optimal time suggestions based on audience engagement, content calendar for planning campaigns, and multi-platform posting to Facebook, Instagram, Twitter, LinkedIn, and more. Analytics showing engagement metrics and follower growth, content library for storing and reusing posts, and team collaboration with approval workflows. Hashtag suggestions and performance tracking, competitor analysis for benchmarking, and RSS feed integration for content curation. Post recycling for evergreen content, social listening for brand mentions, and integration with design tools for creating social media graphics.",
    "size": 76.8,
    "reviews": "11.2k",
    "ratingAvg": 4.5,
    "downloads": "2.0M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 4800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Night Mode",
    "companyName": "Eye Care",
    "id": 165,
    "description": "Blue light filter for better sleep with customizable color temperature, scheduling based on sunrise/sunset, and additional screen dimming features for comfortable nighttime device use. Features include adjustable color temperature from normal to very warm, automatic scheduling based on your location or custom times, and gradual transition between modes to avoid abrupt changes. Screen dimming beyond system minimum for very dark environments, notification management to reduce disruptions at night, and bedtime mode that limits stimulating apps. Integration with sleep tracking apps to correlate filter use with sleep quality, different profiles for various activities (reading, gaming, etc.), and quick toggle for temporary disabling. Widget for easy access to settings, and compatibility with all apps unlike system-level filters.",
    "size": 22.7,
    "reviews": "23.4k",
    "ratingAvg": 4.6,
    "downloads": "5.3M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2800 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 11100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Running Tracker",
    "companyName": "Run Pro",
    "id": 166,
    "description": "GPS running tracker with route mapping, pace analysis, and training plans for runners of all levels from beginners to marathon trainers. Features include GPS tracking with map display and elevation data, pace analysis with splits and average calculations, and audio feedback during runs announcing distance, pace, and time. Training plans for various race distances with adaptive scheduling based on progress, route planning with points of interest, and social features for sharing runs and competing with friends. Integration with heart rate monitors for intensity tracking, weather integration for run planning, and shoe mileage tracking with replacement reminders. Race prediction based on training performance, running form analysis using phone sensors, and recovery recommendations between workouts.",
    "size": 89.3,
    "reviews": "15.6k",
    "ratingAvg": 4.7,
    "downloads": "2.8M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Meme Generator",
    "companyName": "Fun Studio",
    "id": 167,
    "description": "Create and share memes easily with template library, custom text options, and editing tools for making viral content for social media or personal amusement. Features include popular meme templates updated regularly, custom text placement with various fonts and effects, and image editing tools for creating original meme images. Trending meme discovery for inspiration, meme history to revisit your creations, and direct sharing to social media platforms. Collaboration features for creating memes with friends, meme calendar tracking viral trends over time, and community voting on user-created memes. Educational content about meme culture and creation tips, template submission for popularizing your own designs, and privacy controls for saving memes privately or sharing publicly.",
    "size": 53.2,
    "reviews": "8.9k",
    "ratingAvg": 4.4,
    "downloads": "1.9M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 3200 },
      { "name": "5 star", "count": 3400 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Call Recorder",
    "companyName": "Audio Record",
    "id": 168,
    "description": "Record phone calls with automatic transcription, organization tools, and secure storage for business, legal, or personal reference where permitted by law. Features include automatic call recording with selective contact lists, transcription services converting speech to searchable text, and organization with tags and folders. Cloud backup for secure storage, sharing options with privacy controls, and integration with note-taking apps. Compliance features including announcement tones where required by law, consent management for tracking permissions, and legal disclaimer templates. Business features for customer service quality assurance, search within transcriptions for specific conversations, and export options for legal proceedings. Encryption for sensitive conversations, and automatic deletion based on retention policies.",
    "size": 68.9,
    "reviews": "13.4k",
    "ratingAvg": 4.3,
    "downloads": "2.2M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 4500 },
      { "name": "5 star", "count": 5400 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Kanban Board",
    "companyName": "Project Tools",
    "id": 169,
    "description": "Visual project management with Kanban boards, task cards, and collaboration features for teams or individuals organizing work using agile methodology. Features include customizable boards with multiple columns, drag-and-drop task cards with detailed information, and assignment to team members with due dates. Attachment support for files and images, checklist creation within tasks, and labels for categorization. Progress tracking with burndown charts, time tracking for tasks, and reporting on team productivity. Template library for common project types, integration with calendar apps, and offline access for viewing and updating boards. Team collaboration with commenting and notifications, and export options for sharing project status with stakeholders.",
    "size": 45.7,
    "reviews": "11.2k",
    "ratingAvg": 4.7,
    "downloads": "2.1M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 5150 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Compression Tool",
    "companyName": "File Tools",
    "id": 170,
    "description": "Compress and decompress files easily with support for multiple archive formats, password protection, and batch processing for handling multiple files efficiently. Features include support for ZIP, RAR, 7Z, TAR, and other archive formats, password protection with strong encryption, and compression level adjustment for balancing file size and speed. Batch compression of multiple files or folders, extraction with preservation of directory structure, and preview of archive contents before extraction. Cloud storage integration for compressing files directly from cloud services, sharing compressed files via various methods, and organization of frequently used compression settings. Integration with file managers for seamless workflow, and repair tools for damaged archives when possible.",
    "size": 72.4,
    "reviews": "8.9k",
    "ratingAvg": 4.5,
    "downloads": "1.7M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "GPS Navigator",
    "companyName": "Map Pro",
    "id": 171,
    "description": "Offline GPS navigation with turn-by-turn directions, points of interest database, and route optimization for driving, walking, or cycling without internet connection. Features include downloadable maps for entire countries or regions, turn-by-turn voice guidance with street names, and alternative route suggestions. Points of interest search including restaurants, gas stations, and attractions, traffic information where available even offline using cached data, and speed limit warnings. Route planning with multiple stops, favorite locations for quick navigation, and sharing ETA with contacts. Integration with calendar for automatic navigation to appointments, lane guidance for complex intersections, and dash cam mode for recording journeys.",
    "size": 156.8,
    "reviews": "18.7k",
    "ratingAvg": 4.6,
    "downloads": "3.8M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 8200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Puzzle Games",
    "companyName": "Brain Games",
    "id": 172,
    "description": "Collection of challenging puzzle games including logic puzzles, word games, number puzzles, and spatial reasoning challenges with adaptive difficulty. Features include daily puzzle challenges with global leaderboards, hundreds of levels across multiple game types, and adaptive difficulty that adjusts to your skill level. Progress tracking with statistics on solving times and accuracy, hint system for when you're stuck, and tutorial modes for learning new puzzle types. Offline play for all games, social features for competing with friends, and new puzzle packs added regularly. Educational value with information about puzzle types and solving strategies, and accessibility options including colorblind modes and adjustable time limits.",
    "size": 124.6,
    "reviews": "11.2k",
    "ratingAvg": 4.7,
    "downloads": "2.3M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 4800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Email Client",
    "companyName": "Mail Pro",
    "id": 173,
    "description": "Advanced email client with multiple account support, unified inbox, and productivity features for efficient email management across personal and professional accounts. Features include support for all major email providers (Gmail, Outlook, Yahoo, iCloud, etc.), unified inbox for viewing all accounts together, and smart categorization of emails into primary, social, and promotional tabs. Snooze emails to reappear at appropriate times, send later scheduling for optimal delivery times, and follow-up reminders for emails that need replies. Attachment management with cloud storage integration, email templates for frequent responses, and undo send for retrieving accidentally sent emails. Security features including phishing detection, encryption for sensitive emails, and privacy-focused design that doesn't store emails on external servers.",
    "size": 67.9,
    "reviews": "15.6k",
    "ratingAvg": 4.5,
    "downloads": "2.9M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Astronomy Guide",
    "companyName": "Star Watch",
    "id": 174,
    "description": "Identify stars, planets, and constellations using augmented reality, learn about celestial events, and track satellites with detailed information about space objects. Features include AR mode pointing your camera at the sky to identify objects, night mode preserving dark adaptation, and calendar of celestial events (meteor showers, eclipses, planet alignments). Satellite tracking including ISS and Starlink satellites, detailed information about stars and deep sky objects, and telescope integration for controlling compatible devices. Observing lists for planning viewing sessions, weather integration for clear sky forecasts, and community sharing of observations. Educational content about astronomy concepts, space mission tracking, and historical astronomical events.",
    "size": 142.5,
    "reviews": "8.9k",
    "ratingAvg": 4.8,
    "downloads": "1.5M",
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 4200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Text Editor",
    "companyName": "Write Pro",
    "id": 175,
    "description": "Advanced text editor with markdown support, syntax highlighting for programming languages, and writing tools for authors, students, and developers. Features include markdown preview while writing, syntax highlighting for over 100 programming languages, and word count with reading time estimation. Focus mode minimizing distractions, typewriter scrolling keeping current line centered, and document outline for navigation in long documents. Export to various formats including PDF, HTML, and Word, cloud synchronization across devices, and version history for recovering previous drafts. Writing goals with progress tracking, distraction-free full-screen mode, and integration with reference management tools for academic writing. Templates for common document types, and collaboration features for co-authoring.",
    "size": 38.4,
    "reviews": "13.4k",
    "ratingAvg": 4.6,
    "downloads": "2.4M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "BMI Tracker",
    "companyName": "Health Track",
    "id": 176,
    "description": "Track BMI and weight progress over time with additional health metrics, goal setting, and integration with fitness apps for comprehensive health monitoring. Features include BMI calculation with percentile comparison to population averages, weight tracking with trend analysis, and body measurements tracking (waist, hips, etc.). Goal setting with milestone celebrations, photo progress tracking with side-by-side comparison, and integration with smart scales for automatic data recording. Health risk assessment based on multiple factors, recommendations for healthy weight management, and sharing progress with healthcare providers. Privacy-focused design with optional cloud backup, family tracking for monitoring children's growth, and educational content about healthy weight management.",
    "size": 41.7,
    "reviews": "8.9k",
    "ratingAvg": 4.5,
    "downloads": "1.8M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "File Manager",
    "companyName": "File Master",
    "id": 177,
    "description": "Advanced file manager with cloud integration, network access, and file operations for comprehensive file management on device and connected storage. Features include support for local storage, cloud services (Google Drive, Dropbox, OneDrive, etc.), and network shares (SMB, FTP, WebDAV). File operations including copy, move, rename, delete, and compress, batch operations for handling multiple files, and search with advanced filters. File preview for documents, images, videos, and audio, text editor for quick file editing, and APK management for Android users. Root access for advanced users on rooted devices, storage analysis showing space usage by file type, and hidden file management. Security features including file encryption, app locking, and privacy vault for sensitive files.",
    "size": 56.3,
    "reviews": "15.6k",
    "ratingAvg": 4.7,
    "downloads": "3.0M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Circuit Builder",
    "companyName": "Electronics Pro",
    "id": 178,
    "description": "Build and simulate electronic circuits with component library, virtual testing equipment, and educational resources for students, hobbyists, and engineers. Features include drag-and-drop component placement, wiring tools for connecting components, and simulation showing voltage, current, and signal flow. Virtual test equipment including multimeter, oscilloscope, and function generator, component library with resistors, capacitors, transistors, ICs, and more. Circuit analysis showing calculations for voltage, current, and power, educational mode explaining circuit principles, and sharing circuits with others for collaboration. Project saving with organization, template circuits for common designs, and integration with 3D printing for creating physical circuit boards from designs.",
    "size": 189.6,
    "reviews": "8.9k",
    "ratingAvg": 4.6,
    "downloads": "1.2M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Drum Machine",
    "companyName": "Music Studio",
    "id": 179,
    "description": "Virtual drum machine with various kits, pattern sequencing, and effects for creating drum tracks, practicing rhythm, or composing music on mobile device. Features include multiple drum kits (acoustic, electronic, world percussion), step sequencer for programming patterns, and real-time recording of drum performances. Effects processing including reverb, delay, and compression, mixing controls for individual drum sounds, and export of drum tracks as audio files. Educational modes for learning rhythm patterns, metronome with various time signatures, and integration with other music apps. Pattern library for different music genres, tempo adjustment with tap tempo, and synchronization with other musicians via network or Bluetooth.",
    "size": 134.8,
    "reviews": "11.2k",
    "ratingAvg": 4.5,
    "downloads": "1.9M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 4800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Study Timer",
    "companyName": "Study Focus",
    "id": 180,
    "description": "Timer with breaks for effective studying using Pomodoro technique or custom intervals, with tracking of study sessions and productivity analytics. Features include customizable study/break intervals, task tracking for what you study during each session, and statistics showing your most productive study times. Focus sounds or white noise during study sessions, break suggestions including stretching or eye exercises, and goal setting for daily study targets. Minimalist interface to reduce distractions, synchronization across devices for consistent tracking, and integration with calendar apps for scheduling study sessions. Study group features for coordinated study sessions with classmates, and subject tracking to allocate time appropriately across different topics.",
    "size": 36.9,
    "reviews": "13.4k",
    "ratingAvg": 4.7,
    "downloads": "2.3M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6550 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Receipt Scanner",
    "companyName": "Expense Pro",
    "id": 181,
    "description": "Scan and organize receipts for expenses with OCR extraction of merchant, date, and amount, plus integration with expense reporting and accounting software. Features include automatic receipt capture with edge detection, OCR extracting key information from receipts, and categorization by expense type. Integration with expense reporting tools for business reimbursement, export to accounting software like QuickBooks or Xero, and mileage tracking using GPS. Per diem calculation for business travel, report generation for tax purposes, and multi-currency support for international expenses. Organization with tags and folders, search across all scanned receipts, and secure cloud backup. Business features including approval workflows and policy compliance checking.",
    "size": 68.7,
    "reviews": "8.9k",
    "ratingAvg": 4.6,
    "downloads": "1.7M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Morse Code",
    "companyName": "Communication Tools",
    "id": 182,
    "description": "Learn and translate Morse code with interactive lessons, practice exercises, and communication tools for using Morse code in real-world situations. Features include interactive lessons teaching Morse code characters, practice exercises with increasing difficulty, and translation tools for converting text to Morse code and vice versa. Flashlight or vibration output for practicing without sound, speed adjustment for learning at your own pace, and progress tracking with statistics on accuracy and speed. Historical information about Morse code usage, emergency communication patterns (SOS, etc.), and games for making learning fun. Integration with messaging apps for sending Morse code messages, and accessibility features for communication assistance.",
    "size": 32.4,
    "reviews": "11.2k",
    "ratingAvg": 4.5,
    "downloads": "1.6M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 5150 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Dictionary Pro",
    "companyName": "Word Reference",
    "id": 183,
    "description": "Comprehensive dictionary with offline support, thesaurus, word origins, and language tools for writers, students, and language enthusiasts. Features include definitions with multiple meanings and usage examples, thesaurus with synonyms and antonyms, and word origins with etymology information. Pronunciation guides with audio from native speakers, word of the day for vocabulary building, and offline access to entire dictionary database. Word lists for vocabulary learning, flashcard creation for studying, and integration with reading apps for looking up words in context. Translation features for multiple languages, grammar checking tools, and historical word usage showing how meanings have changed over time. Professional terminology dictionaries for specialized fields available as add-ons.",
    "size": 234.8,
    "reviews": "15.6k",
    "ratingAvg": 4.8,
    "downloads": "3.2M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 7300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Sudoku Pro",
    "companyName": "Puzzle Games",
    "id": 184,
    "description": "Thousands of Sudoku puzzles of all difficulties with solving aids, statistics tracking, and community features for Sudoku enthusiasts of all skill levels. Features include multiple difficulty levels from beginner to expert, hint system showing possible moves, and error checking to prevent mistakes. Statistics tracking solving times and accuracy across difficulty levels, daily challenges with global leaderboards, and puzzle generator for unlimited new puzzles. Note-taking system for pencil marks, auto-fill for obvious cells, and multiple solving techniques explained within the app. Offline play for all puzzles, sync across devices to continue puzzles anywhere, and community forum for sharing strategies. Accessibility options including high contrast mode and larger number displays.",
    "size": 46.3,
    "reviews": "13.4k",
    "ratingAvg": 4.7,
    "downloads": "2.5M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6550 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Focus Timer",
    "companyName": "Productivity Pro",
    "id": 185,
    "description": "Timer for focused work sessions with ambient sounds, progress tracking, and integration with task management for productive deep work periods. Features include customizable focus intervals, ambient sound mixing for concentration, and task integration to track what you work on during each session. Progress statistics showing your focus patterns over time, goal setting for daily focus targets, and break suggestions including stretching or breathing exercises. Minimalist interface eliminating distractions, synchronization across devices, and integration with calendar apps for scheduling focus blocks. Team focus sessions for coordinated work in remote teams, and focus challenges for motivation through gamification. Export of focus data for personal analysis and optimization of work habits.",
    "size": 28.7,
    "reviews": "8.9k",
    "ratingAvg": 4.6,
    "downloads": "1.9M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Note Taking",
    "companyName": "Note Pro",
    "id": 186,
    "description": "Advanced note taking with formatting, organization, and synchronization across devices for capturing ideas, meeting notes, and information management. Features include rich text formatting with styles and lists, checklist creation for task management, and image and file attachment support. Organization with notebooks, tags, and search across all notes, synchronization across all devices with offline access, and collaboration for shared notes. Template creation for frequently used note formats, handwriting support with stylus compatibility, and audio recording integration with notes. Web clipping for saving online content, export in various formats including PDF and Word, and security with optional password protection. Integration with calendar and task management apps for comprehensive productivity system.",
    "size": 52.6,
    "reviews": "18.7k",
    "ratingAvg": 4.7,
    "downloads": "3.6M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 8200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Chess Master",
    "companyName": "Board Games",
    "id": 187,
    "description": "Play chess against AI or online opponents with analysis tools, lessons, and tournament features for players of all skill levels from beginner to advanced. Features include adjustable AI difficulty from beginner to grandmaster level, online multiplayer with matchmaking and rankings, and analysis tools showing best moves and mistakes. Interactive lessons teaching openings, tactics, and endgames, puzzle mode for practicing specific skills, and game history with analysis of previous matches. Tournament organization for clubs or groups, live broadcasting of notable games with commentary, and integration with chess communities and organizations. Offline play against AI, synchronization of progress across devices, and accessibility options including larger piece displays and color schemes.",
    "size": 124.8,
    "reviews": "11.2k",
    "ratingAvg": 4.8,
    "downloads": "2.2M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 5700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Data Backup",
    "companyName": "Backup Pro",
    "id": 188,
    "description": "Automatically backup your important data including contacts, messages, photos, and documents with encryption and easy restoration when needed. Features include scheduled automatic backups, selective backup choosing which data types to include, and encryption for sensitive information. Cloud storage integration with major providers, local backup to computer or external storage, and restoration to new device or after data loss. Versioning keeping multiple backup versions, compression to reduce storage needs, and notification of backup completion or issues. Family plans for backing up multiple devices, business features including centralized administration, and migration tools for switching to new devices. Security features including zero-knowledge encryption where provider cannot access your data.",
    "size": 67.9,
    "reviews": "8.9k",
    "ratingAvg": 4.5,
    "downloads": "1.8M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Symptom Checker",
    "companyName": "Health Check",
    "id": 189,
    "description": "Check symptoms and get health information with guidance on when to seek medical care, preparation for doctor visits, and tracking of health history. Features include symptom checker with body map interface, information about common conditions and treatments, and guidance on emergency vs. non-emergency symptoms. Preparation tools for doctor visits including symptom history export, medication tracking with interactions checking, and health journal for tracking symptoms over time. Integration with health apps for comprehensive data, educational content about health conditions, and privacy-focused design keeping health information secure. Family profiles for tracking symptoms of household members, and reminders for preventive care and screenings based on age and gender.",
    "size": 89.3,
    "reviews": "15.6k",
    "ratingAvg": 4.4,
    "downloads": "2.9M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 5600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Book Reader",
    "companyName": "Read Pro",
    "id": 190,
    "description": "Ebook reader with customizable settings, library management, and reading tools for enjoying digital books with optimal reading experience. Features include support for multiple ebook formats (EPUB, PDF, MOBI, etc.), customizable reading experience (fonts, sizes, margins, colors), and library organization with collections and tags. Reading progress synchronization across devices, dictionary lookup for unfamiliar words, and note-taking with highlighting and annotations. Reading statistics tracking time spent reading and progress, goal setting for daily reading targets, and integration with ebook stores and libraries. Accessibility features including text-to-speech, dyslexia-friendly fonts, and screen reader compatibility. Social features for sharing reading progress and book recommendations with friends.",
    "size": 58.4,
    "reviews": "13.4k",
    "ratingAvg": 4.7,
    "downloads": "2.4M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Guitar Tuner",
    "companyName": "Music Tools",
    "id": 191,
    "description": "Precision guitar tuner with multiple modes for different instruments, tuning presets for various musical styles, and tools for maintaining instrument health. Features include chromatic tuner for any instrument, instrument-specific modes (guitar, bass, ukulele, violin, etc.), and tuning presets for alternate tunings. Metronome with various time signatures and subdivision options, chord library with finger positions and audio examples, and scale practice tools. Instrument maintenance reminders for string changes and setup, tone generator for hearing reference pitches, and recording tools for tracking progress. Educational content about tuning theory and ear training, integration with music learning apps, and sharing tunings with other musicians.",
    "size": 42.7,
    "reviews": "8.9k",
    "ratingAvg": 4.6,
    "downloads": "1.7M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Language Detector",
    "companyName": "Language Tools",
    "id": 192,
    "description": "Detect language of any text input with confidence scores, character set identification, and translation integration for handling multilingual content. Features include language detection for over 100 languages, confidence score showing detection certainty, and character set identification for proper display. Batch processing for multiple text samples, history of previous detections, and integration with translation apps for immediate translation. Educational content about language families and writing systems, statistical analysis of text features, and API for developers to integrate detection into their apps. Privacy-focused design processing text locally when possible, and organization tools for working with multilingual documents.",
    "size": 56.8,
    "reviews": "11.2k",
    "ratingAvg": 4.5,
    "downloads": "1.9M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 4800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Time Zone Converter",
    "companyName": "World Time",
    "id": 193,
    "description": "Convert time between different time zones with meeting planner, world clock display, and scheduling tools for international collaboration and travel planning. Features include time zone conversion for any location, meeting planner finding times that work across multiple time zones, and world clock with favorite cities. Daylight saving time adjustments automatically handled, historical time zone data for past dates, and integration with calendar apps for automatic conversion. Travel planning with jet lag calculator and adjustment recommendations, sharing of time zone information with colleagues, and business hours display for international contacts. Educational content about time zones and their history, and widget for quick time checks without opening app.",
    "size": 34.2,
    "reviews": "13.4k",
    "ratingAvg": 4.7,
    "downloads": "2.3M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6550 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Mind Map",
    "companyName": "Brainstorm Pro",
    "id": 194,
    "description": "Create visual mind maps for ideas, planning, and organization with flexible structure, styling options, and collaboration features for individual or team brainstorming. Features include drag-and-drop node creation and organization, styling options for colors, shapes, and connections, and attachment support for files and links. Multiple layout options (radial, tree, organizational chart), template library for common mind map types, and export to various formats including image and outline. Collaboration for team mind mapping with real-time editing, presentation mode for sharing ideas, and integration with productivity apps. Offline access with sync when online, keyboard shortcuts for efficient creation, and search across all mind maps. Educational templates for students and teachers, and business templates for project planning and strategy development.",
    "size": 78.9,
    "reviews": "8.9k",
    "ratingAvg": 4.6,
    "downloads": "1.6M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whrPfsTF/demo-app-1.webp",
    "title": "Baby Tracker",
    "companyName": "Parenting Pro",
    "id": 195,
    "description": "Track feeding, sleeping, and diaper changes with growth charts, milestone tracking, and sharing features for coordinating care between parents and caregivers. Features include feeding tracking (breastfeeding, bottle, solids) with timing and amounts, sleep tracking with patterns and quality notes, and diaper changes with type and consistency. Growth tracking with percentile charts for weight, height, and head circumference, milestone tracking for developmental achievements, and medication tracking with dosage reminders. Sharing with partners, grandparents, or caregivers for coordinated care, photo journal for capturing special moments, and integration with pediatrician visits. Educational content about infant development, community forum for parent questions, and data export for medical consultations. Multiple child profiles for families with more than one child.",
    "size": 67.4,
    "reviews": "11.2k",
    "ratingAvg": 4.8,
    "downloads": "2.1M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 5700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9nXsVn/demo-app-2.webp",
    "title": "Flashlight Pro",
    "companyName": "Utility Tools",
    "id": 196,
    "description": "Bright flashlight with strobe and SOS modes, color options, and additional tools for emergency situations or everyday use in dark environments. Features include adjustable brightness levels, strobe mode at various frequencies, and SOS mode for emergency signaling. Color options including red for night vision preservation, screen flashlight using device screen as light source, and widget for quick access. Battery level display with estimated remaining use time, shake to turn on/off for quick access, and lock screen widget for emergency use. Compass and level tools for additional utility, Morse code signaling using flashlight, and integration with other emergency apps. Accessibility features including camera flash as constant light source, and automatic turn-off timer to preserve battery.",
    "size": 18.6,
    "reviews": "23.4k",
    "ratingAvg": 4.7,
    "downloads": "5.4M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2800 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 11100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzy3zL83/demo-app-4.webp",
    "title": "Weather Widget",
    "companyName": "Widget Pro",
    "id": 197,
    "description": "Beautiful weather widget for home screen with customizable designs, multiple locations, and detailed weather information at a glance without opening app. Features include multiple widget sizes and styles, customizable colors and transparency, and current conditions with temperature and icons. Forecast display for next several hours or days, severe weather alerts, and multiple location support. Weather information including humidity, wind, precipitation chance, and sunrise/sunset times, and automatic location updating. Integration with system dark/light mode, battery-efficient updates, and tap to open full weather app for more details. Specialized widgets for different needs (minimalist, detailed, travel, etc.), and sharing weather information with others.",
    "size": 23.8,
    "reviews": "15.6k",
    "ratingAvg": 4.6,
    "downloads": "3.1M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTMFgvD0/demo-app-6.webp",
    "title": "Sound Meter",
    "companyName": "Audio Tools",
    "id": 198,
    "description": "Measure sound levels in decibels with calibration options, historical tracking, and recommendations for hearing protection in loud environments. Features include real-time decibel measurement with frequency weighting (A, C, Z), calibration for accurate readings, and historical tracking of sound levels over time. Recommendations for hearing protection based on exposure time and intensity, noise dose calculation for workplace safety, and comparison to common sound levels for reference. Export of measurement data for reporting, alerts when sound exceeds safe levels, and integration with health apps for hearing wellness tracking. Educational content about hearing health, sound level regulations for different environments, and tools for acoustic testing and room analysis.",
    "size": 36.5,
    "reviews": "8.9k",
    "ratingAvg": 4.5,
    "downloads": "1.8M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLc1MMgx/demo-app-3.webp",
    "title": "Ruler Pro",
    "companyName": "Measurement Tools",
    "id": 199,
    "description": "Digital ruler for accurate measurements using device camera with calibration, multiple units, and tools for measuring objects in photos or real world. Features include camera-based measurement using augmented reality, calibration with known object for accuracy, and multiple unit options (inches, centimeters, millimeters, etc.). Photo measurement allowing measurement of objects in existing photos, level tool for checking surfaces, and protractor for angle measurement. Measurement history for reference, sharing of measurements with others, and integration with note-taking apps. Educational content about measurement principles, conversion between measurement systems, and tools for specific professions (carpentry, sewing, etc.). Accessibility features including voice output of measurements for visually impaired users.",
    "size": 29.7,
    "reviews": "11.2k",
    "ratingAvg": 4.7,
    "downloads": "2.0M",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 5150 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwqsCK7q/demo-app-5.webp",
    "title": "Speed Calculator",
    "companyName": "Math Tools",
    "id": 200,
    "description": "Calculate speed, distance, and time with unit conversions, historical calculations, and specialized calculators for different transportation modes and activities. Features include speed/distance/time calculation with any two values known, unit conversion between different measurement systems, and historical calculation saving. Specialized calculators for running pace, driving speed, aviation calculations, and nautical speed, and integration with GPS for real-time speed measurement. Educational content about speed concepts and formulas, sharing of calculations with others, and tools for trip planning and fuel efficiency calculation. Custom formula creation for specialized needs, and integration with fitness apps for athletic performance analysis.",
    "size": 31.4,
    "reviews": "8.9k",
    "ratingAvg": 4.6,
    "downloads": "1.7M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 3900 }
    ]
  }
]